from typing import Optional

from fastmcp import FastMCP

from ..qdrant.retriver_product import retriever_product_hybrid_async
from ..qdrant.retriver_product import retriever_product_hybrid_mult_async
from ..postgres.postgres_util import insert_dialog_state

tool_product_search = FastMCP(name="product_search")

@tool_product_search.tool(
    name="product_search",
    description=(
    """
    Retrieve products based on query and optional indications, contraindications, body parts and product_type.
    When forming a search query, first fill in : indications, contraindications, body parts and at the end as an additional description.
    Follow the lists exactly when generating a search query by parameters: indications, contraindications, body parts.
    Pick only one similar symptoms or cosmetic needs for one indication or contraindication.

    Пример 1: Клиент: "Мне нужен массаж чтобы убрать отечность ног, но у меня варикозная болезнь"
          Вход: 
          query_search = 
          {
            "query": "массаж",
            "indications": ["отечность"],
            "contraindications": ["варикоз"],
            "body_parts": ["ноги"],
          }

    Пример 2: Клиент: "У меня редкие волосы на бровях, что можете предложить?"
          Вход: 
          query_search = 
          {
            "query": "",
            "indications": ["редкие"],
            "contraindications": [],
            "body_parts": ["брови, волосы"],
          }
    
    Пример 3: Клиент: "Есть ли услуги для коррекции фигуры?"
          Вход: 
          query_search = 
          {
            "query": "",
            "indications": ["коррекция фигуры"],
            "contraindications": [],
            "body_parts": [],
            "product_type": [],
          }

    Пример 4: Клиент: "Нужна эпиляция волос подмышками?"
          Вход: 
          query_search = 
          {
            "query": "эпиляция",
            "indications": ["волосы"],
            "contraindications": [],
            "body_parts": ["подмышки"],
          }

    Пример 5: Клиент: "У Вас есть акции на услуги?"
          Вход: 
          query_search = 
          {
            "query": "акции",
            "indications": [],
            "contraindications": [],
            "body_parts": [],
            "session_id": "1_232327692"
          }
    
    Пример 6: Клиент: "Какие есть комплексы для коррекции фигуры"
          Вход: 
          query_search = 
          {
            "query": "комплексы",
            "indications": [коррекция фигуры],
            "contraindications": [],
            "body_parts": [],
            "session_id": "1_232327692"
          }

    Пример 7: Клиент: "Можно записаться на консультацию"
          Вход: 
          query_search = 
          {
            "query": "консультация",
            "indications": [],
            "contraindications": [],
            "body_parts": [],
            "session_id": "1_232327692"
          }

    Args:
        query (str, optional): A free-text search query to match against product descriptions.

        indications (List[str], optional): A list of positive indications (symptoms or cosmetic needs).
            Only the following values are allowed:
            "акне", "активный образ жизни", "аллергия на косметику", "аллергия на пигмент", "алопеция", "альтернатива ботоксу", "асимметрия",
            "асимметрия бровей", "асимметрия всех зон", "асимметрия глаз", "асимметрия губ", "атоничность", "атрофия мышц", "бледные губы",
            "болевой синдром", "брыли", "быстрое заживление", "введение лекарственных веществ", "веснушки", "воздействие неблагоприятных факторов",
            "возрастная пигментация", "возрастная потеря объема", "возрастные изменения", "возрастные изменения контура", "воспаления", "восстановление",
            "восстановление после процедур", "вросшие", "второй подбородок", "выпадение волос", "выразительный рисунок", "выцветание",
            "выявление противопоказаний", "вялость кожи", "гиперкератоз", "гиперпигментация", "гиперчувствительность", "глубокие морщины",
            "густая растительность", "дополнение коллекции", "дополнение татуировок", "дополнительная прорисовка", "дополнительное заполнение",
            "дряблость", "естественный макияж", "естественный результат", "желание подчеркнуть глаза", "желание подчеркнуть линию роста",
            "желание создать глянец", "желание удалить", "желание четкой линии", "жесткие", "жирная кожа", "жирная кожа головы", "жирный блеск",
            "жировые отложения", "загрязнения пор", "закрепление результата процедур", "закрытые комедоны", "закупорка пор", "замедление роста волос",
            "заметная небольшая татуировка", "застой лимфы", "изменение обстоятельств", "изменение оттенка", "изменение размера", "изменение цвета",
            "искажение рисунка", "истончение волос", "комбинированная кожа", "комедоны", "комплексная коррекция", "комплексная реабилитация",
            "комплексное омоложение", "комплексный макияж", "коррекция контура", "коррекция области", "коррекция плана лечения", "коррекция проблемной области",
            "коррекция фигуры", "коррекция формы", "коррекция формы глаз", "косметический дефект", "купероз", "локальные воспаления",
            "локальные жировые отложения", "максимальная экономия времени", "максимальный эффект", "мелазма", "мешки под глазами", "милиумы",
            "множественные папилломы", "морщины", "мышечные боли", "мышечные спазмы", "мягкое подчеркивание глаз", "напряжение мышц", "нарушение баланса",
            "нарушение кровообращения", "нарушение микроциркуляции", "нарушение работы сальных желез", "нарушения микроциркуляции", "нарушения осанки",
            "недостаток времени", "недостаточная насыщенность", "нежелательные", "неравномерное заживление", "неровная текстура", "неровности",
            "неровный тон", "неудачный результат", "нечеткий контур", "низкая болевая переносимость", "низкий мышечный тонус", "носогубные складки

        contraindications (List[str], optional): A list of negative indications to exclude.
            Only the following values are allowed:
            "аллергия", "антикоагулянты", "аутоиммунные заболевания", "беременность", "ботокс", "варикоз", "воспаление", "воспаление в полости рта",
            "воспалительные заболевания глаз", "герпес", "гипертония", "гипертрихоз", "гиперчувствительность", "гипотония", "грибковые заболевания",
            "дерматит", "диабет", "заболевания десен", "заболевания зубов", "заболевания легких", "загар", "изотретиноин", "инфекция", "инъекции",
            "кардиостимулятор", "келоидные рубцы", "клаустрофобия", "кожные заболевания", "конъюнктивит", "купероз", "лактация", "лимфаденит", "лихорадка",
            "менее месяца после процедуры", "менструация", "мочекаменная болезнь", "нарушение целостности кожи", "нарушения ритма",
            "нарушения свертываемости", "невралгия", "неврологические заболевания", "онкология", "острые инфекции", "острые травмы",
            "открытые раны", "отсутствуют", "печёночная недостаточность", "планирование беременности", "подозрение на злокачественность",
            "почечная недостаточность", "протезы", "психические заболевания", "псориаз", "родимые пятна с волосами", "розацеа", "сахарный диабет",
            "склонность к гиперпигментации", "склонность к отекам", "склонность к рубцеванию", "сосудистые заболевания", "сухость кожи", "татуировки",
            "температура", "тромбоз", "тромбофлебит", "фотосенсибилизирующие препараты", "щитовидка", "экзема", "эпилепсия"

        body_parts (List[str], optional): A list of body parts to be treated/serviced.
            Only the following values are allowed:
            "ареолы", "бакенбарды", "бедра", "белая линия живота", "бикини глубокое", "бикини классическое", "брови", "веки",
            "верхнее веко", "верхняя губа", "виски", "внешняя часть бедра", "внутренняя часть бедра", "вокруг сосков",
            "глубокое бикини", "голени", "голень", "голова", "грудь полностью", "губы", "декольте", "живот", "живот полностью",
            "кисти", "кисти рук", "кожа", "кожа головы", "колени", "костюм", "лицо", "лоб", "межбровье", "межгрудная область",
            "межресничное пространство", "межъягодичная впадина", "нижнее веко", "ноги", "ноги полностью", "окантовка бороды",
            "пальцы", "пальцы ног", "пальцы рук", "плечевой пояс", "плечи", "подбородок", "подмышки", "поясница", "предплечья",
            "руки", "руки выше локтя", "руки до локтя", "руки полностью", "скулы", "спина", "спина до поясницы", "спина полностью",
            "стопы", "стрелка", "стрелки", "тело", "уши", "шейно-воротниковая зона", "шея", "щеки", "ягодицы"

        session_id(str): id dialog session.

        channel_id(str): id channal company. 

        Returns:
            List[dict]: A list of services, each represented by a dictionary with detailed metadata:
                - product_id (str): Идентификатор продукта.
                - product_name (str): Название продукта.
                - body_parts (str): Части тела.
                - product_type (str): Формат обслуживания.
                - product_description (str): Описание процедуры или продукта.
                - duration (int): Продолжительность процедуры в минутах.
                - price (str): Цена процедуры в денежном формате.
    """
    )
)
async def product_search(
    channel_id: str,
    session_id: str,
    query: Optional[str] = None,
    indications: Optional[list[str]] = None,
    contraindications: Optional[list[str]] = None,
    body_parts: Optional[list[str]] = None,
    # product_type: Optional[list[str]] = None,

) -> list[dict]:
    
    responce = await retriever_product_hybrid_async(
        channel_id=channel_id,
        query=query,
        indications=indications,
        contraindications=contraindications,
        body_parts=body_parts,
        # product_type=product_type,
    )
    
    insert_dialog_state(
        session_id=session_id,
        product_search={
            "query_search":{
                "query": query,
                "indications": indications,
                "contraindications": contraindications,
                "body_parts": body_parts,
                # "product_type": product_type,
            },
            "product_list": responce,
        },
        name='selecting',
    )

    return responce